export default {
  my_name: "Лев Савин",
  save: "Сохранить",
  no_data: "Нет данных",
  table_columns_view: "Отображение колонок таблицы",
  lang: "Язык",
  form_dynamic_validation: "Динамическая валидация формы",
  more: "Еще",

  abbout: {
    title: "Обо мне",
    text_1: "Я фронтенд-разработчик с 2 годами опыта построения веб-сайтов.",
    text_2:
      "Мне  очень  нравится  делать  сложные  системы,  которые можно разложить на простые компоненты.",
    text_3:
      "Я  ценю  советы  от  более  опытных  коллег  и  всегда прислушиваюсь к конструктивной критике.",
    text_4:
      "Здесь представлены мои лучшие работы, также вы можете посмотреть исходнинки кода по",
    link: "ссылке.",
  },

  pages: {
    notFound: "Страница не найдена",
  },

  modals: {
    confirm_label: "Подтвердите действие",
  },

  messages: {
    succcess: "Успешно",
    error: "Ошибка",
  },

  menu: {
    main_menu: "Главное меню",
    about: "Обо мне",
    portfolio: "Портфолио",
    examples_functionality: "Примеры функционала",
    dynamic_validation: "Динамическая валидация",
    editable_dynamic_table: "Редактируемая динамическая таблица",
  },

  form: {
    transport: "Транспорт",
    counterparty: "Контрагент",
  },

  pass: {
    requirements: "Требования к паролю",
    title:
      "Для защиты ваших данных, нужно придумать надежный пароль. Он должен содержать:",
    require_1: "- 6 и более символов",
    require_2: "- прописные латинские буквы",
    require_3: "- строчные латинские буквы",
    require_4: "- цифры",
  },
};
