export default {
  here: "Здесь",
  here_lowercase: "здесь",
  view_code_1: "вы можете посмотреть код этой страницы, ",
  view_code_2: " - код валидации.",
  validation_1:
    "Задача: сделать валидацию формы на стороне клиента не определяя заранее правила валидации для полей.",
  validation_2:
    "Бэкенд присылает json с наборами правил для каждого поля, фронтенд на основе полученных данных динамически формирует правила для валидации форм.",
  validation_3: "Для каждого поля могут быть любые комбинации правил.",
  validation_4:
    "Добавить возможность бэкенду менять правила валидации (пригодится например, чтобы для одного пользователя были одни правила валидации, а для другого пользователя - другие. Либо менять правила в процессе заполнения формы в зависимости от введённых значений).",
  validation_5: "Для смены правил валидации нажми кнопку ниже.",
};
