export default {
  here: "Здесь",
  here_lowercase: "здесь",
  view_code_1: "вы можете посмотреть код этой страницы, ",
  view_code_2: " - код компонента валидации.",
  table_code: " - код компонента таблциы.",
  validation_1:
    "Задача: сделать валидацию формы на стороне клиента не определяя заранее правила валидации для полей.",
  validation_2:
    "Бэкенд присылает json с наборами правил для каждого поля, фронтенд на основе полученных данных динамически формирует правила для валидации форм.",
  validation_3: "Для каждого поля могут быть любые комбинации правил.",
  validation_4:
    "Добавить возможность бэкенду менять правила валидации (пригодится например, чтобы для одного пользователя были одни правила валидации, а для другого пользователя - другие. Либо менять правила в процессе заполнения формы в зависимости от введённых значений).",
  validation_5: "Для смены правил валидации нажми кнопку ниже.",
  table_task_1: "Задача:",
  table_task_2:
    "1. Сделать динамическую таблицу без заранее заданных столбцов с возможностью редактировать содержимое ячеек таблицы.",
  table_task_3:
    "2. Добавить динамическую валидацию редактируемых данных на стороне клиента, не определяя заранее правила валидации для полей.",
  table_text_2:
    "Бэкенд присылает данные, а строки и столбцы таблицы на фронте формируется в соответствии с полученными данными.",
  table_text_3:
    "Также бэкенд присылает json с наборами правил валидации для каждого поля, фронтенд на основе полученных данных динамически формирует правила для валидации форм.",
  table_text_4: "Ячейки с возможностью редактирования выделены тенью.",
  saved_data: "Сохраненные данные",
};
