<template>
  <iconsWrapper :width="width" :height="height" :viewBox="viewBox">
    <g id="News_Feed" data-name="News Feed" transform="translate(0.5 0.5)">
      <rect id="bounds" width="18" height="18" fill="none" />
      <path
        id="Icon"
        d="M-15921.906-14281a3.435,3.435,0,0,1-3.094-3.549v-10.895a3.418,3.418,0,0,1,3.237-3.554h11.522a3.42,3.42,0,0,1,3.237,3.554v10.895a3.438,3.438,0,0,1-3.094,3.549Zm-1.559-14.443v10.895a1.807,1.807,0,0,0,1.7,1.891h11.522a1.807,1.807,0,0,0,1.7-1.891v-10.895a1.807,1.807,0,0,0-1.7-1.891h-11.522A1.807,1.807,0,0,0-15923.465-14295.446Zm2.525,9.907a.8.8,0,0,1-.768-.827.8.8,0,0,1,.768-.831h9.876a.8.8,0,0,1,.768.831.8.8,0,0,1-.768.827Zm9.876-3.629a.762.762,0,0,1-.684-.468l-.743-1.631a.908.908,0,0,0-.132-.2.655.655,0,0,0-.488-.224.655.655,0,0,0-.487.224l-.451.5a1.518,1.518,0,0,1-1.132.516,1.516,1.516,0,0,1-1.127-.516l-1.387-1.526a.965.965,0,0,0-.132-.116.627.627,0,0,0-.5-.088.7.7,0,0,0-.444.355l-1.519,2.786a.759.759,0,0,1-.479.372.821.821,0,0,1-.168.02.724.724,0,0,1-.4-.124.878.878,0,0,1-.264-1.131l1.507-2.766a2.423,2.423,0,0,1,.331-.472,2.135,2.135,0,0,1,1.583-.72,2.122,2.122,0,0,1,1.583.72l1.383,1.53a.044.044,0,0,0,.071,0l.452-.5a2.29,2.29,0,0,1,.575-.46,2.039,2.039,0,0,1,1.65-.155,2.259,2.259,0,0,1,1.352,1.251l.743,1.626a.874.874,0,0,1-.344,1.107.7.7,0,0,1-.344.092Z"
        transform="translate(15925 14299)"
        :fill="iconColor"
        stroke="rgba(0,0,0,0)"
        stroke-width="1"
      />
    </g>
  </iconsWrapper>
</template>

<script>
import iconsWrapper from "@/components/icons/iconsWrapper.vue";
export default {
  name: "iconNews",
  components: {
    iconsWrapper,
  },
  props: {
    iconColor: {
      type: String,
      default: "currentColor",
    },
    //ширина обёртки картинки
    width: {
      type: [Number, String],
      default: 13,
    },
    //высота обёртки картинки
    height: {
      type: [Number, String],
      default: 13,
    },
    viewBox: {
      type: String,
      default: "0 0 18.997 18.99",
    },
  },
};
</script>
